@extends('master')



@section('content')

<h3>Технічне завдання для інтернет-сайту «Restaurant Guide»</h3>

<p>Структура документу:</p>
<ul>1.	Загальні положення
	<li>1.1	Предмет розробки</li>
</ul>
	
<ul>2.	Вимоги до графічного дизайну сайту
	<li>2.1	Вимоги до дизайну сайту</li>
</ul>
<ul>3.	Функціональні вимоги
	<li>3.1	Класи користувачів</li>
</ul>
<ul>4.	Вимоги структури та графічного оформлення
	<li>4.1	Требования к информационному обеспечению</li>
	<li>4.2	Вимоги до структури сайту</li>
</ul>

<p><b>1. Загалні положення</b></p>
<p>1.1 Предмет розробки</p>
<p>Предметом розробки являється інтернет-сайт «Restaurant Guide», з системой динамічного керування.</p>
<ul>Призначення сайту:
<li>Представлення інформації про ресторани на території України;</li>
<li>Представлення інформації про національні кухні на території України та які ресторани в неї входять;</li>
<li>Надання можливості залишати  та бачити відгуки користувачам про ресторани;</li>
</ul> 

<p><b>2. Вимоги до графічного дизайну сайту</b></p>
<p>2.1 Вимоги до дизайну сайту</p>
<p>При розробці сайту повинні бути використане поєднання темних і світлих кольорів.
Оформлення повинно бути розроблено у консервативному напрямку.
Основні розділи сайту повинні бути доступними з головної сторінки.
</p>
<ul>В дизайні сайту не повинні бути присутні:
<li>Спливаючі банери;</li>
<li>Багато зливаючого тексту;</li>
<li>Поєднання яскравих кольорів.</li>
</ul>
<p><b>3. Функціональні вимоги</b></p>
<p>3.1 Класи користувачів</p>
<ul>1) Гість – неавторизований користувач, володіє правами:
<li>Головна сторінка – перегляд</li>
<li>Розділ «Ресторани» – перегляд</li>
<li>Розділ «Кухні» – перегляд</li>
<li>Розділ «Контакні дані»  – просмотр</li>
<li>Можливістю пошуку в розділах «Кухні» та «Ресторани»</li>
</ul>
<ul>2) Авторизований користувач, володіє правами:
<li>Головна сторінка – перегляд</li>
<li>Розділ «Ресторани» – перегляд</li>
<li>Розділ «Кухні» – перегляд</li>
<li>Розділ «Контакні дані»  – просмотр</li>
<li>Можливістю пошуку в розділах «Кухні» та «Ресторани»</li>
<li>Можливістю додавати об’єкти в розділах «Кухні» та «Ресторани»</li>
<li>Можлиістю залишати відгуки в усіх об’єктах розділів «Кухні» та «Ресторани»</li>
</ul>
<ul>3) Адміністратор – користувач, авторизований в інтерфейсі адміністрування порталу, який володіє правами:
<li>Головна сторінка – перегляд</li>
<li>Розділ «Ресторани» – перегляд</li>
<li>Розділ «Кухні» – перегляд</li>
<li>Розділ «Контакні дані»  – просмотр</li>
<li>Можливістю пошуку в розділах «Кухні» та «Ресторани»</li>
<li>Можливістю додавати об’єкти в розділах «Кухні» та «Ресторани»</li>
<li>Можливістю залишати відгуки в усіх об’єктах розділів «Кухні» та «Ресторани»</li>
<li>Можливістю видаляти об’єкти в розділах «Кухні» та «Ресторани»</li>
</ul>
<p><b>4.	Вимоги структури та графічного оформлення</b></p>
<p>4.1 Вимоги до графічного оформлення</p>
<p><i>Вимоги щодо представлення головної сторінки сайту</i></p>
<img src="/img/page1.jpg">
<p><i>Вимоги щодо представлення сторінки з контактною інформацією </i></p>
<img src="/img/page1.jpg">
<p><i>Вимоги щодо представлення сторінки авторизації</i></p>
<img src="/img/page2.jpg">
<p><i>Вимоги щодо представлення сторінки реєстрації</i></p>
<img src="/img/page3.jpg">
<p><b>4.2 Вимоги до структури сайту</b></p>
<p>Структура сайту повинна мати наступний вигляд:</p>
<ul>1.	Головна
<li>Ресторани</li>
<li>Кухні</li>
</ul>
<ul>2.	Контакт
<li>Загальна інформація про розробника</li>
</ul>
<ul>3.	Авторизація
<li>Форма для авторизації</li>
<li>Наявність можливості відновити доступ, якщо забули пароль або логін</li>
</ul>
<ul>4.	Реєстрація
<li>Форма для реєстрації користувачів</li>
</ul>
@endsection